In [3]:
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
# pandas dataframe

# import data from a csv file

employees = pd.read_csv("employee_dataset.csv")

In [19]:
# show the shape of the dataframe
employees.shape

(100, 7)

In [20]:
# show the number of records in the dataset
employees.shape[0]

100

In [ ]:
# show the structure of the dataset
employees.dtypes

In [ ]:
# show the first 5 records in the dataset
employees.head(10)

In [ ]:
# show the last 5 records
employees.tail()

In [ ]:
# showing some columns
employees[["firstname","lastname","gender"]]

In [ ]:
# use  loc[]
employees.loc[0:5]

In [ ]:
# use loc to show records from index 10 to 20
employees.loc[10:20]

In [ ]:
employees.loc[10:14 , ["firstname","lastname","gender"]]

In [6]:
# changing the data type of dob and doh

employees["dob"] = pd.to_datetime(employees["dob"])

In [ ]:
employees.dtypes

In [8]:
employees["doh"] = pd.to_datetime(employees["doh"])

In [9]:
# how to create new columns
employees["fullname"] = employees["firstname"] + " " + employees["lastname"]

In [ ]:
employees.head()

In [9]:
# Create a new column that shows the length of each fullname column
# call it numchar
employees["numchar"] = employees["fullname"].apply(len)

In [ ]:
employees.head()

In [11]:
# Deleting a column

employees.drop("numchar", axis = 1 , inplace = True)

In [ ]:
employees.head()

In [10]:
employees["age"] = pd.Timestamp("today").year - employees["dob"].dt.year

In [ ]:
employees.head()

In [11]:
# CREATE A NEW COLUMN CALLED year_of_service that shows how long an employee
# has worked in an organisation
employees["year_of_service"] = pd.Timestamp("today").year - employees["doh"].dt.year

In [ ]:
# the number of male vs female in the dataset

employees["gender"].value_counts()

In [ ]:
# the number of employees in each dept
employees["dept"].value_counts()

In [ ]:
# Sorting
employees.sort_values("salary",ascending = False)

In [ ]:
# SHOW THE TOP 5 SALARY EARNERS 
employees.sort_values("salary",ascending = False).head()

In [ ]:
# SHOW THE bottom 5 SALARY EARNERS 
employees.sort_values("salary",ascending = True).head()

In [ ]:
# SHOW THE bottom 5 SALARY EARNERS 
employees.sort_values("salary",ascending = False).tail()
# employees.nsmallest(5,"salary")

In [ ]:
employees.head()

In [ ]:
# create  the year of hire column call it hire_year
employees["hire_year"] = employees["doh"].dt.year
employees.head()

In [ ]:
# create the month of hire column and call it hire_month

employees["hire_month"] = employees["doh"].dt.month_name().str[0:3]
employees.head()

In [ ]:
# create the day of hire column and call it hire_day
employees["hire_day"] = employees["doh"].dt.day_name().str[0:3]
employees.head()

In [ ]:
# show all employees that were hired between Monday and Wednesday
employees[employees["hire_day"].isin(["Mon","Tue","Wed"])]

In [ ]:
# rename the year_of_service column to yos
employees.rename(columns= {"year_of_service" : "yos"}, inplace = True)
employees.head()

In [ ]:
# show the employees whose year_of_service is less than 5
employees[employees["yos"] < 5]

In [ ]:
# pick a sample of 5 employees
employees.sample(5)

In [ ]:
# show the summary statistics on the salary column
employees["salary"].describe().round(2)

In [ ]:
# check for null values in any column
employees.isna().any()

In [ ]:
# drop rows with missing values
employees.dropna().any()

In [ ]:
# get employees with salaries in the bottom 10%
employees[employees["salary"] <= employees["salary"].quantile(0.10)]

In [ ]:
# get a summary count of gender in each dept using pd.crosstab()
pd.crosstab(employees["dept"],employees["gender"])

In [ ]:
# show the unique departments in the  dataframe
employees["dept"].unique()

In [ ]:
# show the number of unique departments in the dataframe
employees["dept"].nunique()

In [158]:
# show the  unique hire year in the dataframe
employees["hire_year"].unique()

array([2020, 2022, 2017, 2024, 2023, 2021, 2016, 2018, 2019, 2015, 2025],
      dtype=int32)

In [159]:
# show the number of unique hire year in the dataframe
employees["hire_year"].nunique()

11

In [ ]:
# show employees who joined on weekends 
employees[employees["hire_day"].isin(["Sat","Sun"])]

In [ ]:
# show the employees that were hired between 2016 and 2017
employees[employees["hire_year"].between(2016,2017)]

In [ ]:
# show employees in IT or HR dept that are female
employees[(employees["dept"].isin(["IT","HR"]))  & (employees["gender"] == "Female")]

In [ ]:
# show the total salary payout for each department
# Aggregation using groupby() function
employees.groupby("dept")['salary'].sum().reset_index(name = "total_salary")

In [ ]:
# show the maximum salary in each department 
employees.groupby("dept")["salary"].max()

In [ ]:
# show the top 5 employees that earns the highest salary
employees.nlargest(5,"salary")

In [ ]:
# show the top 5 highest earners in the HR dept
employees[employees["dept"] == "HR"].nlargest(5,"salary")

In [16]:
# show the employee that earns the highest in the company
employees.nlargest(1,"salary")

,firstname,lastname,gender,dob,doh,dept,salary,fullname,age,yos,hire_year,hire_month,hire_day
61,Amber,Ortiz,Male,1998-01-14,2019-01-22,Admin,118934,Amber Ortiz,27,6,2019,Jan,Tue

In [ ]:
# show the employee who joined the company earliest in the dataset
employees.nsmallest(1,"doh")

# employees[employees["doh"] == employees["doh"].min()]

In [ ]:
# show the employees in the top 25% salary bracket
employees[employees["salary"] >= employees["salary"].quantile(0.75)]

In [ ]:
# find the top 4 highest paid employees in each department using groupby() and apply(lambda)
employees.groupby("dept").apply(lambda x: x.nlargest(4,"salary"))

In [174]:
# show the dept that has the largest salary payout amongst the others
employees.groupby("dept")["salary"].sum().idxmax()

'HR'

In [ ]:
# show the dept that has the lowest salary payout amongst the others
employees.groupby("dept")["salary"].sum().idxmin()

In [ ]:
# remove duplicate rows if they exist
employees.drop_duplicates()

In [180]:
# show the dept which has the particular employee that earns the highest in the whole of the company
employees.groupby("dept")["salary"].max().idxmax()

'Admin'

In [182]:
# show the department with the highest number of employees
employees.groupby("dept")["dept"].count().idxmax()

'HR'

In [ ]:
# count employees by department and gender using groupby and size() functions
employees.groupby(["dept","gender"]).size()

In [6]:
# create a new column called salary_levels. The values will be low_earners for those whose 
# salaries between 30000 and 50000, average_earners for salaries between 50000 and 75000, and high_earners
# for those whose salaries are above 75000 and up to 140000

employees["salary_levels"] = pd.cut(employees["salary"], bins = [30000,50000,75000,140000],
                  labels= ["low_earners","average_earners","high_earners"])
employees.head()

,firstname,lastname,gender,dob,doh,dept,salary,salary_levels
0,Megan,Mccoy,Female,1994-09-11,2020-12-22,Admin,47673,low_earners
1,Katherine,Bruce,Female,1968-09-25,2020-06-23,IT,61474,average_earners
2,Robert,Sanchez,Male,1982-01-11,2022-06-10,HR,93154,high_earners
3,Jonathan,Dennis,Female,1975-02-13,2017-03-27,Sales,76166,high_earners
4,William,Wilson,Female,1994-10-06,2017-01-28,Admin,109971,high_earners

In [ ]:
# show all employees that are high earners
employees[employees["salary_levels"] == "high_earners"]

In [7]:
# show the number of employees in each salary level
employees["salary_levels"].value_counts().reset_index(name = "count of employees")

     salary_levels  count of employees
0     high_earners                  50
1      low_earners                  25
2  average_earners                  25

In [ ]:
# show the total number of employees hired in each month of the year 2020
employees[employees["hire_year"] == 2020]["hire_month"].value_counts().reset_index(name = "count")

In [ ]:
# show the total employees hired in each year 
# employees.groupby(["hire_year","hire_month"])["hire_year"].value_counts()
pd.crosstab(employees["hire_year"],employees["hire_month"])

In [90]:
# get average salary by gender
employees.groupby("gender")["salary"].mean().reset_index(name="average salary")

   gender  average salary
0  Female        71620.34
1    Male        78000.60

In [ ]:
# get average salary by dept and then by gender using groupby function

employees.groupby(["dept","gender"])["salary"].sum().reset_index(name="average salary").round(2)

In [ ]:
# get average salary by dept and then by gender using crosstab function
pd.crosstab(employees["dept"],employees["gender"],employees["salary"],aggfunc=sum)

In [ ]:
# get all employees with fullname starting with A
employees[employees["fullname"].str.startswith("A")]

In [ ]:
# get the first 3 letter of the employees fullname

employees["fullname"].str[0:3]

In [ ]:
# create a salary rank column that ranks salary using the rank() function, call it salary_rank 
employees["salary_rank"] = employees["salary"].rank(ascending= False).astype(int)
employees.head()

In [101]:
# save the dataset in a csv file using the to_csv() function
employees.to_csv("employees_analysed.csv", index = False)

In [ ]:
# sort the employees dataset by salary rank column
employees.sort_values("salary_rank", ascending= True)

In [ ]:
# create a new column called salary_increase and apply 10% salary increase to all
employees["salary_increase"] = employees["salary"] * 1.10
employees.head()

In [ ]:
# find the second highest salary earner in the company
employees[employees["salary_rank"] == 2]

# employees.nlargest(2,"salary").tail(1)

In [ ]:
# show the mean, min , max and count of salaries by dept using the agg() function

employees.groupby("dept")["salary"].agg(["mean","min","max","count"]).round(2)

In [ ]:
# Use pivot_table() function to show max salary by gender/department
# use the following named parameters - values,index,columns and aggfunc
employees.pivot_table(index= "gender", columns= "dept",values = "salary",aggfunc=max)

C:\Users\HP\AppData\Local\Temp\ipykernel_9124\1554147259.py:3: FutureWarning: The provided callable <built-in function max> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  employees.pivot_table(index= "gender", columns= "dept",values = "salary",aggfunc=max)

dept     Admin  Finance      HR      IT  Marketing   Sales
gender
Female  115299   101901  107368  113545     118313  118264
Male    118934   118573  115664  115100     103584   99251